**Terraform Plan**
```
[0m[1mazurerm_resource_group.rg: Refreshing state... [id=/subscriptions/1d2e52d9-93e9-4ee4-b2c6-badd357535e3/resourceGroups/preprod][0m
[0m[1mazurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/1d2e52d9-93e9-4ee4-b2c6-badd357535e3/resourceGroups/preprod/providers/Microsoft.Network/virtualNetworks/vnet-preprod][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # azurerm_virtual_network.vnet[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_network" "vnet" {
      [33m~[0m[0m dns_servers             = [] -> (known after apply)
      [31m-[0m[0m flow_timeout_in_minutes = 0 [90m-> null[0m[0m
      [33m~[0m[0m guid                    = "718de3c8-3513-42d5-ba4d-59cf81be4e99" -> (known after apply)
      [33m~[0m[0m id                      = "/subscriptions/1d2e52d9-93e9-4ee4-b2c6-badd357535e3/resourceGroups/preprod/providers/Microsoft.Network/virtualNetworks/vnet-preprod" -> (known after apply)
      [33m~[0m[0m name                    = "vnet-preprod" [33m->[0m[0m "vpc-preprod" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnet                  = [] -> (known after apply)
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```